[
  {
    "path": "posts/oaire_graph_2020/",
    "title": "Accessing and analysing the OpenAIRE Research Graph data dumps",
    "description": "The OpenAIRE Research Graph provides a wide range of metadata about grant-supported research publications. This blog post presents an experimental R package with helpers for splitting, de-compressing and parsing the underlying data dumps. I will demonstrate how to use them by examining the compliance of funded projects with the open access mandate in Horizon 2020.",
    "author": [
      {
        "name": "Najko Jahn",
        "url": "https://twitter.com/najkoja"
      }
    ],
    "date": "2020-04-07",
    "categories": [],
    "preview": "posts/oaire_graph_2020/distill-preview.png",
    "last_modified": "2020-04-08T15:20:41+02:00",
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/unpaywall_python/",
    "title": "Exploring the Open Access Evidence Base in Unpaywall with Python",
    "description": "Open Access evidence sources constantly change. In this blog post, I present a Python based approach for analysing the most recent snapshots from the open access discovery service Unpaywall. Results shows a growth in open access content, partly because of newly introduced evidence sources like Semantic Scholar.",
    "author": [
      {
        "name": "Nick Haupka",
        "url": {}
      }
    ],
    "date": "2020-03-30",
    "categories": [],
    "preview": "posts/unpaywall_python/distill-preview.png",
    "last_modified": "2020-04-08T14:57:37+02:00",
    "preview_width": 3385,
    "preview_height": 1256
  },
  {
    "path": "posts/elsevier_invoice/",
    "title": "Mining and analysing invoice data from Elsevier relative to hybrid open access",
    "description": "Publishers rarely make publication fee spending for hybrid journals transparent. Elsevier is a remarkable exception, as the publisher provides open and machine-readable data relative to its central invoicing with funding bodies and fee waivers at the article level. This blogpost illustrates how to mine Elsevier full-texts for these data with the data science tool R and presents new insights by analysing the resulting dataset: of 70,657 articles published open access in 1,753 hybrid journals from 2015 to date, around one third of the publication fees were paid through central agreements. Nevertheless, the majority of funding sources for hybrid open access remains unclear.",
    "author": [
      {
        "name": "Najko Jahn",
        "url": "https://twitter.com/najkoja"
      }
    ],
    "date": "2019-11-25",
    "categories": [],
    "preview": "posts/elsevier_invoice/distill-preview.png",
    "last_modified": "2020-02-27T08:55:02+01:00",
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/datacite_graph/",
    "title": "Interfacing the PID Graph with R",
    "description": "The PID Graph from DataCite interlinks persistent identifiers (PID) in research. In this blog post, I will present how to interface this graph using the DataCite GraphQL API with R. To illustrate it, I will visualise the research information network of a  person.",
    "author": [
      {
        "name": "Najko Jahn",
        "url": "https://twitter.com/najkoja"
      }
    ],
    "date": "2019-10-24",
    "categories": [],
    "preview": "posts/datacite_graph/distill-preview.png",
    "last_modified": "2020-02-27T08:59:43+01:00",
    "preview_width": 3900,
    "preview_height": 2400
  },
  {
    "path": "posts/unpaywall_evidence/",
    "title": "Open Access Evidence in Unpaywall",
    "description": "We investigated more than 31 million scholarly journal articles published between 2008 and 2018 that are indexed in Unpaywall, a widely used open access discovery tool. Using Google BigQuery and R, we determined over 11.6 million journal articles with open access full-text links in Unpaywall, corresponding to an open access share of 37 %. Our data analysis revealed various open access location and evidence types, as well as large overlaps between them, raising important questions about how to responsibly re-use Unpaywall data in bibliometric research and open access monitoring.",
    "author": [
      {
        "name": "Najko Jahn",
        "url": "https://twitter.com/najkoja"
      },
      {
        "name": "Anne Hobert",
        "url": {}
      }
    ],
    "date": "2019-05-07",
    "categories": [],
    "preview": "posts/unpaywall_evidence/distill-preview.png",
    "last_modified": "2019-11-18T13:55:18+01:00",
    "preview_width": 1248,
    "preview_height": 768
  }
]
